---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.TopRailType
source: html/ac86fe2e-fe0c-dcd4-8b83-47c63eabf270.htm
---
# TopRailType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.